In [31]:
import numpy as np

In [32]:
import pandas as pd

In [33]:
sozluk1={"isim":["ahmet","zeynep","atıl","mehmet"],
         "spor":["basketbol","koşu","yüzme","koşu"],
         "kalori":[100,200,300,400]}

In [34]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3]) # dataframe haline çevirdik.

In [35]:
dataFrame1

     isim       spor  kalori
0   ahmet  basketbol     100
1  zeynep       koşu     200
2    atıl      yüzme     300
3  mehmet       koşu     400

In [36]:
sozluk2={"isim":["osman","levent","atlas","fatma"],
         "spor":["basketbol","koşu","yüzme","koşu"],
         "kalori":[200,200,50,30]}

In [37]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [38]:
dataFrame2

     isim       spor  kalori
4   osman  basketbol     200
5  levent       koşu     200
6   atlas      yüzme      50
7   fatma       koşu      30

In [39]:
sozluk3={"isim":["ayşe","mahmut","duygu","nur"],
         "spor":["koşu","yüzme","badminton","tenis"],
         "kalori":[300,400,500,250]}

In [40]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [41]:
dataFrame3

      isim       spor  kalori
8     ayşe       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

## Concatenation

In [42]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # alt alta liste halinde birleştiriyor.

      isim       spor  kalori
0    ahmet  basketbol     100
1   zeynep       koşu     200
2     atıl      yüzme     300
3   mehmet       koşu     400
4    osman  basketbol     200
5   levent       koşu     200
6    atlas      yüzme      50
7    fatma       koşu      30
8     ayşe       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

## Merge

In [52]:
mergesozluk1={"isim":["ayşe","mahmut","duygu","nur"],
            "spor":["koşu","yüzme","badminton","tenis"]}

In [53]:
mergeDataFrame1=pd.DataFrame(mergesozluk1)

In [54]:
mergeDataFrame1

     isim       spor
0    ayşe       koşu
1  mahmut      yüzme
2   duygu  badminton
3     nur      tenis

In [55]:
mergesozluk2={"isim":["ahmet","mehmet","zeynep","atil"],
            "kalori":[100,200,150,250]}

In [56]:
mergeDataFrame2=pd.DataFrame(mergesozluk2)

In [57]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     150
3    atil     250

In [59]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="isim") # isim kolonu üzerinden ortak nokta seçip birleştiriyor

Empty DataFrame
Columns: [isim, spor, kalori]
Index: []

In [63]:
maasSozluk ={"isim":["ahmet","mehmet","zeynep","atil"],
            "departman":["yazılım","satış","pazarlama","yazılım"],
            "maaş":[200,300,400,500]}

In [66]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [67]:
maasDataFrame

     isim  departman  maaş
0   ahmet    yazılım   200
1  mehmet      satış   300
2  zeynep  pazarlama   400
3    atil    yazılım   500

In [70]:
maasDataFrame["departman"].unique()  # tekilleri getir demek 2.kez yazılımı getirmiycek

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [71]:
maasDataFrame["departman"].nunique() # kaç tane departman var

3

In [72]:
maasDataFrame["departman"].value_counts() # hangi departmandan kaç tane var

yazılım      2
pazarlama    1
satış        1
Name: departman, dtype: int64